project4/app/controllers/admins_controller.rb

  def verify_redirect
    temp_user = User.find_by(nameDotNumber: params[:nameDotNumber])
---
SELECT "users".* FROM "users" WHERE "users"."nameDotNumber" = ? LIMIT ?  [["nameDotNumber", "Ohio"], ["LIMIT", 1]]

  def verify
    @unverified_users = User.order(sort_column + " " + sort_direction)
---
SELECT "users".* FROM "users" WHERE "users"."verified" = ? ORDER BY nameDotNumber asc  [["verified", "false"]]