project4/app/controllers/courses_controller.rb

  def create
    @course = Course.new(my_params_course)
    if @course.save
      redirect_to @course
    else
      render :'scrapes/new'
    end
  end

  private def search(search)
    #if there was a search query
    if search
      #take all fields and use them to narrow down matches
      list = Course.where("catalog_number like ?", "%#{search}%")
      list = list.where("term like ?", "%#{@term}%")
      list.where("title like ?", "%#{@title}%")
---
INSERT INTO "courses" ("title", "term", "units", "campus", "catalog_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "courses".* FROM "courses" WHERE "courses"."catalog_number" = ? LIMIT ?  [["catalog_number", "2321"], ["LIMIT", 1]]

    nil
    if term and term != ""
      #check if there is a course with this term
      courses = Course.where("term like ?", "%#{term}%")
      if not courses.blank?
---
SELECT "courses".* FROM "courses" WHERE (term like '%2022%')
SELECT "courses".* FROM "courses" WHERE (term like '%21%')

    nil
    if title and title != ""
      #check if there is a course with this title
      courses = Course.where("title like ?", "%#{title}%")
      if not courses.blank?
---
SELECT "courses".* FROM "courses" WHERE (title like '%soft%')
SELECT "courses".* FROM "courses" WHERE (title like '%software%')