project4/app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections"
INSERT INTO "sections" ("classNumber", "meetingDays", "meetingTimes", "waitlistTotal", "endDate", "startDate", "enrollmentStatus", "instructionMode", "component", "section", "courseID", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def all
    @sections = Scrape.get_scraped_sections()
    if (@sections)
      @sections.each do |section|
        if section[0] == params[:key]
          section[1].each do |sect|
            section = Section.new(classNumber: sect[0], meetingDays: sect[1]['meetingDays'], meetingTimes: sect[1]['meetingTimes'], waitlistTotal: sect[1]['waitlistTotal'], endDate: sect[1]['endDate'], startDate: sect[1]['startDate'], enrollmentStatus: sect[1]['enrollmentStatus'], instructionMode: sect[1]['instructionMode'], component: sect[1]['component'], section: sect[1]['section'], courseID: params[:courseID])
            if !section.save

INSERT INTO "sections" ("classNumber", "meetingDays", "meetingTimes", "waitlistTotal", "endDate", "startDate", "enrollmentStatus", "instructionMode", "component", "section", "courseID", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @section = Section.new(section_params)

    if @section.save

SELECT "courses".* FROM "courses" WHERE (ROWID = 1)
---
  def set_section
    @section = Section.find(params[:id])
  end

  private def get_matching_catalog_numbers(courseID, sections)
    if (courseID > 0 || sections)
      if (sections)
        catalog_nums = []
        sections.each do |sect|
          item = Course.where("ROWID = ?", sect.courseID)[0]