project4/app/views/admins/verify.html.erb

SELECT "users".* FROM "users" WHERE "users"."verified" = ? ORDER BY nameDotNumber asc  [["verified", "false"]]
---
    <tbody>
      <!--% User.where(verified: "false").each do |t| %-->