project4/app/views/pages/verify.html.erb

SELECT "users".* FROM "users" WHERE "users"."verified" = ?  [["verified", "false"]]
---
    <tbody>
      <% User.where(verified: "false").each do |t| %>