project4/app/views/courses/show.html.erb

<% @sections.each do |section| %>
  <% Scrape.get_database_section_keys.each do |k| %>
---
SELECT "sections".* FROM "sections" WHERE (courseID = 2)